# RemovePaint Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Document..::..RemovePaint Method
Document Class See Also
---
Remove the material painted on the element's face. If the face is currently not painted,it will do nothing.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public void RemovePaint(
	ElementId elementId,
	Face face
)
```

Visual Basic
---
```text
Public Sub RemovePaint ( _
	elementId As ElementId, _
	face As Face _
)
```

Visual C++
---
```text
public:
void RemovePaint(
	ElementId^ elementId,
	Face^ face
)
```

# ### Parameters
elementId
    Type: Autodesk.Revit.DB..::..ElementId The element that the painted face belongs to.
face
    Type: Autodesk.Revit.DB..::..Face The painted element's face.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The element elementId does not exist in the document -or- The face doesn't belong to the element |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
Document Class
Autodesk.Revit.DB Namespace